<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string></string>
	<key>Description</key>
	<string>Downloads the latest version of Papers.</string>
	<key>Identifier</key>
	<string>com.github.qu1gl3s.download.Papers4</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Papers</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>Papers_Setup_\S*\.dmg</string>
                    <key>url</key>
                    <string>https://update.readcube.com/desktop/updates/latest-mac.yml</string>
                </dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://update.readcube.com/desktop/updates/%match%</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Papers.app</string>
				<key>requirement</key>
				<string>identifier "com.ReadCube.Papers" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = FY6R4ETYH7</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
